# Membalik urutan baris dan kolom pada Data Frame

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  6  9  8  2  3
1  4  3  5  5  8
2  5  5  9  5  9
3  6  7  6  4  4
4  3  2  6  1  1

# Membalikan Urutan Kolom

In [5]:
df.loc[:, ::-1]

   E  D  C  B  A
0  3  2  8  9  6
1  8  5  5  3  4
2  9  5  9  5  5
3  4  4  6  7  6
4  1  1  6  2  3

# Membalik Urutan Baris

In [6]:
df.loc[::-1]

   A  B  C  D  E
4  3  2  6  1  1
3  6  7  6  4  4
2  5  5  9  5  9
1  4  3  5  5  8
0  6  9  8  2  3

# Membalik Urutan Baris dan Melakukan Penyesuaian Ulang Index

In [7]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  2  6  1  1
1  6  7  6  4  4
2  5  5  9  5  9
3  4  3  5  5  8
4  6  9  8  2  3